FreedomBen/rtl8188ce-linux-driver/rtl8723e/reg.h
#define REG_NAV_CTRL				0x0650
#define REG_BACAMCMD				0x0654
#define REG_BACAMCONTENT			0x0658
#define REG_LBDLY					0x0660
#define REG_FWDLY					0x0661
#define REG_RXERR_RPT				0x0664
#define REG_WMAC_TRXPTCL_CTL		0x0668

#define REG_CAMCMD					0x0670
#define REG_CAMWRITE				0x0674
#define REG_CAMREAD					0x0678
#define REG_CAMDBG					0x067C
#define REG_SECCFG					0x0680

#define REG_WOW_CTRL				0x0690
#define REG_PSSTATUS				0x0691
#define REG_PS_RX_INFO				0x0692
#define REG_LPNAV_CTRL				0x0694
#define REG_WKFMCAM_CMD				0x0698
#define REG_WKFMCAM_RWD				0x069C
#define REG_RXFLTMAP0				0x06A0
#define REG_RXFLTMAP1				0x06A2
#define REG_RXFLTMAP2				0x06A4
#define REG_BCN_PSR_RPT				0x06A8
#define REG_CALB32K_CTRL			0x06AC
#define REG_PKT_MON_CTRL			0x06B4
#define REG_BT_COEX_TABLE			0x06C0
#define REG_WMAC_RESP_TXINFO		0x06D8

#define REG_USB_INFO				0xFE17
#define REG_USB_SPECIAL_OPTION		0xFE55
#define REG_USB_DMA_AGG_TO			0xFE5B
#define REG_USB_AGG_TO				0xFE5C
#define REG_USB_AGG_TH				0xFE5D

#define REG_TEST_USB_TXQS			0xFE48
#define REG_TEST_SIE_VID			0xFE60
#define REG_TEST_SIE_PID			0xFE62
#define REG_TEST_SIE_OPTIONAL		0xFE64
#define REG_TEST_SIE_CHIRP_K		0xFE65
#define REG_TEST_SIE_PHY			0xFE66
#define REG_TEST_SIE_MAC_ADDR		0xFE70
#define REG_TEST_SIE_STRING			0xFE80

#define REG_NORMAL_SIE_VID			0xFE60
#define REG_NORMAL_SIE_PID			0xFE62
#define REG_NORMAL_SIE_OPTIONAL		0xFE64
#define REG_NORMAL_SIE_EP			0xFE65
#define REG_NORMAL_SIE_PHY			0xFE68
#define REG_NORMAL_SIE_MAC_ADDR		0xFE70
#define REG_NORMAL_SIE_STRING		0xFE80

#define	CR9346				REG_9346CR
#define	MSR				(REG_CR + 2)
#define	ISR				REG_HISR
#define	TSFR				REG_TSFTR

#define	MACIDR0				REG_MACID
#define	MACIDR4				(REG_MACID + 4)

#define PBP				REG_PBP

#define	IDR0				MACIDR0
#define	IDR4				MACIDR4

#define	UNUSED_REGISTER			0x1BF
#define	DCAM				UNUSED_REGISTER
#define	PSR				UNUSED_REGISTER
#define BBADDR				UNUSED_REGISTER
#define	PHYDATAR			UNUSED_REGISTER

#define	INVALID_BBRF_VALUE		0x12345678

#define	MAX_MSS_DENSITY_2T 		0x13
#define	MAX_MSS_DENSITY_1T 		0x0A

#define	CMDEEPROM_EN			BIT(5)
#define	CMDEEPROM_SEL			BIT(4)
#define	CMD9346CR_9356SEL		BIT(4)
#define	AUTOLOAD_EEPROM			(CMDEEPROM_EN|CMDEEPROM_SEL)
#define	AUTOLOAD_EFUSE			CMDEEPROM_EN

#define	GPIOSEL_GPIO			0
#define	GPIOSEL_ENBT			BIT(5)

#define	GPIO_IN				REG_GPIO_PIN_CTRL
#define	GPIO_OUT			(REG_GPIO_PIN_CTRL+1)
#define	GPIO_IO_SEL			(REG_GPIO_PIN_CTRL+2)
#define	GPIO_MOD			(REG_GPIO_PIN_CTRL+3)

#define	MSR_NOLINK					0x00
#define	MSR_ADHOC					0x01
#define	MSR_INFRA					0x02
#define	MSR_AP						0x03

#define	RRSR_RSC_OFFSET				21
#define	RRSR_SHORT_OFFSET			23
#define	RRSR_RSC_BW_40M				0x600000
#define	RRSR_RSC_UPSUBCHNL			0x400000
#define	RRSR_RSC_LOWSUBCHNL			0x200000
#define	RRSR_SHORT					0x800000
#define	RRSR_1M						BIT(0)
#define	RRSR_2M						BIT(1)
#define	RRSR_5_5M					BIT(2)
#define	RRSR_11M					BIT(3)
#define	RRSR_6M						BIT(4)
#define	RRSR_9M						BIT(5)
#define	RRSR_12M					BIT(6)
#define	RRSR_18M					BIT(7)
#define	RRSR_24M					BIT(8)
#define	RRSR_36M					BIT(9)
#define	RRSR_48M					BIT(10)
#define	RRSR_54M					BIT(11)
#define	RRSR_MCS0					BIT(12)
#define	RRSR_MCS1					BIT(13)
#define	RRSR_MCS2					BIT(14)
#define	RRSR_MCS3					BIT(15)
#define	RRSR_MCS4					BIT(16)
#define	RRSR_MCS5					BIT(17)
#define	RRSR_MCS6					BIT(18)
#define	RRSR_MCS7					BIT(19)
#define	BRSR_ACKSHORTPMB			BIT(23)

#define	RATR_1M						0x00000001
#define	RATR_2M						0x00000002
#define	RATR_55M					0x00000004
#define	RATR_11M					0x00000008
#define	RATR_6M						0x00000010
#define	RATR_9M						0x00000020
#define	RATR_12M					0x00000040
#define	RATR_18M					0x00000080
#define	RATR_24M					0x00000100
#define	RATR_36M					0x00000200
#define	RATR_48M					0x00000400
#define	RATR_54M					0x00000800
#define	RATR_MCS0					0x00001000
#define	RATR_MCS1					0x00002000
#define	RATR_MCS2					0x00004000
#define	RATR_MCS3					0x00008000
#define	RATR_MCS4					0x00010000
#define	RATR_MCS5					0x00020000
#define	RATR_MCS6					0x00040000
#define	RATR_MCS7					0x00080000
#define	RATR_MCS8					0x00100000
#define	RATR_MCS9					0x00200000
#define	RATR_MCS10					0x00400000
#define	RATR_MCS11					0x00800000
#define	RATR_MCS12					0x01000000
#define	RATR_MCS13					0x02000000
#define	RATR_MCS14					0x04000000
#define	RATR_MCS15					0x08000000

#define RATE_1M						BIT(0)
#define RATE_2M						BIT(1)
#define RATE_5_5M					BIT(2)
#define RATE_11M					BIT(3)
#define RATE_6M						BIT(4)
#define RATE_9M						BIT(5)
#define RATE_12M					BIT(6)
#define RATE_18M					BIT(7)
#define RATE_24M					BIT(8)
#define RATE_36M					BIT(9)
#define RATE_48M					BIT(10)
#define RATE_54M					BIT(11)
#define RATE_MCS0					BIT(12)
#define RATE_MCS1					BIT(13)
#define RATE_MCS2					BIT(14)
#define RATE_MCS3					BIT(15)
#define RATE_MCS4					BIT(16)
#define RATE_MCS5					BIT(17)
#define RATE_MCS6					BIT(18)
#define RATE_MCS7					BIT(19)
#define RATE_MCS8					BIT(20)
#define RATE_MCS9					BIT(21)
#define RATE_MCS10					BIT(22)
#define RATE_MCS11					BIT(23)
#define RATE_MCS12					BIT(24)
#define RATE_MCS13					BIT(25)
#define RATE_MCS14					BIT(26)
#define RATE_MCS15					BIT(27)

#define	RATE_ALL_CCK		(RATR_1M | RATR_2M | RATR_55M | RATR_11M)
#define	RATE_ALL_OFDM_AG	(RATR_6M | RATR_9M | RATR_12M | RATR_18M |\
							RATR_24M| RATR_36M | RATR_48M | RATR_54M)
#define	RATE_ALL_OFDM_1SS	(RATR_MCS0 | RATR_MCS1 | RATR_MCS2 |\
							RATR_MCS3 | RATR_MCS4 | RATR_MCS5 |\
							RATR_MCS6 | RATR_MCS7)
#define	RATE_ALL_OFDM_2SS	(RATR_MCS8 | RATR_MCS9 | RATR_MCS10 |\
							RATR_MCS11| RATR_MCS12 | RATR_MCS13 |\
							RATR_MCS14 | RATR_MCS15)

#define	BW_OPMODE_20MHZ				BIT(2)
#define	BW_OPMODE_5G				BIT(1)
#define	BW_OPMODE_11J				BIT(0)

#define	CAM_VALID					BIT(15)
#define	CAM_NOTVALID				0x0000
#define	CAM_USEDK					BIT(5)

#define	CAM_NONE					0x0
#define	CAM_WEP40					0x01
#define	CAM_TKIP					0x02
#define	CAM_AES						0x04
#define	CAM_WEP104					0x05

#define	TOTAL_CAM_ENTRY				32
#define	HALF_CAM_ENTRY				16

#define	CAM_WRITE					BIT(16)
#define	CAM_READ					0x00000000
#define	CAM_POLLINIG				BIT(31)

#define	SCR_USEDK					0x01
#define	SCR_TXSEC_ENABLE			0x02
#define	SCR_RXSEC_ENABLE			0x04

#define	WOW_PMEN					BIT(0)
#define	WOW_WOMEN					BIT(1)
#define	WOW_MAGIC					BIT(2)
#define	WOW_UWF						BIT(3)

#define	IMR8190_DISABLED			0x0
#define	IMR_BCNDMAINT6				BIT(31)
#define	IMR_BCNDMAINT5				BIT(30)
#define	IMR_BCNDMAINT4				BIT(29)
#define	IMR_BCNDMAINT3				BIT(28)
#define	IMR_BCNDMAINT2				BIT(27)
#define	IMR_BCNDMAINT1				BIT(26)
#define	IMR_BCNDOK8					BIT(25)
#define	IMR_BCNDOK7					BIT(24)
#define	IMR_BCNDOK6					BIT(23)
#define	IMR_BCNDOK5					BIT(22)
#define	IMR_BCNDOK4					BIT(21)
#define	IMR_BCNDOK3					BIT(20)
#define	IMR_BCNDOK2					BIT(19)
#define	IMR_BCNDOK1					BIT(18)
#define	IMR_TIMEOUT2				BIT(17)
#define	IMR_TIMEOUT1				BIT(16)
#define	IMR_TXFOVW					BIT(15)
#define	IMR_PSTIMEOUT				BIT(14)
#define	IMR_BCNINT					BIT(13)
#define	IMR_RXFOVW					BIT(12)
#define	IMR_RDU						BIT(11)
#define	IMR_ATIMEND					BIT(10)
#define	IMR_BDOK					BIT(9)
#define	IMR_HIGHDOK					BIT(8)
#define	IMR_TBDOK					BIT(7)
#define	IMR_MGNTDOK					BIT(6)
#define	IMR_TBDER					BIT(5)
#define	IMR_BKDOK					BIT(4)
#define	IMR_BEDOK					BIT(3)
#define	IMR_VIDOK					BIT(2)
#define	IMR_VODOK					BIT(1)
#define	IMR_ROK						BIT(0)

#define	IMR_TXERR					BIT(11)
#define	IMR_RXERR					BIT(10)
#define	IMR_CPWM					BIT(8)
#define	IMR_OCPINT					BIT(1)
#define	IMR_WLANOFF					BIT(0)

/* 8723E series PCIE Host IMR/ISR bit */
/* IMR DW0 Bit 0-31 */
#define	PHIMR_TIMEOUT2					BIT(31)
#define	PHIMR_TIMEOUT1					BIT(30)
#define	PHIMR_PSTIMEOUT				BIT(29)
#define	PHIMR_GTINT4					BIT(28)
#define	PHIMR_GTINT3					BIT(27)
#define	PHIMR_TXBCNERR					BIT(26)
#define	PHIMR_TXBCNOK					BIT(25)
#define	PHIMR_TSF_BIT32_TOGGLE			BIT(24)
#define	PHIMR_BCNDMAINT3				BIT(23)
#define	PHIMR_BCNDMAINT2				BIT(22)
#define	PHIMR_BCNDMAINT1				BIT(21)
#define	PHIMR_BCNDMAINT0				BIT(20)
#define	PHIMR_BCNDOK3					BIT(19)
#define	PHIMR_BCNDOK2					BIT(18)
#define	PHIMR_BCNDOK1					BIT(17)
#define	PHIMR_BCNDOK0					BIT(16)
#define	PHIMR_HSISR_IND_ON			BIT(15)
#define	PHIMR_BCNDMAINT_E				BIT(14)
#define	PHIMR_ATIMEND_E				BIT(13)
#define	PHIMR_ATIM_CTW_END			BIT(12)
#define	PHIMR_HISRE_IND				BIT(11)
#define	PHIMR_C2HCMD					BIT(10)
#define	PHIMR_CPWM2					BIT(9)
#define	PHIMR_CPWM					BIT(8)
#define	PHIMR_HIGHDOK					BIT(7)
#define	PHIMR_MGNTDOK					BIT(6)
#define	PHIMR_BKDOK					BIT(5)
#define	PHIMR_BEDOK					BIT(4)
#define	PHIMR_VIDOK					BIT(3)
#define	PHIMR_VODOK					BIT(2)
#define	PHIMR_RDU						BIT(1)
#define	PHIMR_ROK						BIT(0)

/* PCIE Host Interrupt Status Extension bit */
#define	PHIMR_BCNDMAINT7				BIT(23)
#define	PHIMR_BCNDMAINT6				BIT(22)
#define	PHIMR_BCNDMAINT5				BIT(21)
#define	PHIMR_BCNDMAINT4				BIT(20)
#define	PHIMR_BCNDOK7					BIT(19)
#define	PHIMR_BCNDOK6					BIT(18)
#define	PHIMR_BCNDOK5					BIT(17)
#define	PHIMR_BCNDOK4					BIT(16)
// bit12-15: RSVD
#define	PHIMR_TXERR					BIT(11)
#define	PHIMR_RXERR					BIT(10)
#define	PHIMR_TXFOVW					BIT(9)
#define	PHIMR_RXFOVW					BIT(8)
// bit2-7: RSVD
#define	PHIMR_OCPINT					BIT(1)


