FreedomBen/rtl8188ce-linux-driver/rtl8723e/reg.h
#define	HWSET_MAX_SIZE				256
#define EFUSE_MAX_SECTION			32
#define EFUSE_REAL_CONTENT_LEN			512
#define EFUSE_OOB_PROTECT_BYTES			15

#define	EEPROM_DEFAULT_TSSI					0x0
#define EEPROM_DEFAULT_TXPOWERDIFF			0x0
#define EEPROM_DEFAULT_CRYSTALCAP			0x5
#define EEPROM_DEFAULT_BOARDTYPE			0x02
#define EEPROM_DEFAULT_TXPOWER				0x1010
#define	EEPROM_DEFAULT_HT2T_TXPWR			0x10

#define	EEPROM_DEFAULT_LEGACYHTTXPOWERDIFF	0x3
#define	EEPROM_DEFAULT_THERMALMETER			0x12
#define	EEPROM_DEFAULT_ANTTXPOWERDIFF		0x0
#define	EEPROM_DEFAULT_TXPWDIFF_CRYSTALCAP	0x5
#define	EEPROM_DEFAULT_TXPOWERLEVEL			0x22
#define	EEPROM_DEFAULT_HT40_2SDIFF			0x0
#define EEPROM_DEFAULT_HT20_DIFF			2
#define	EEPROM_DEFAULT_LEGACYHTTXPOWERDIFF	0x3
#define EEPROM_DEFAULT_HT40_PWRMAXOFFSET	0
#define EEPROM_DEFAULT_HT20_PWRMAXOFFSET	0


#define EEPROM_DEFAULT_PID					0x1234
#define EEPROM_DEFAULT_VID					0x5678
#define EEPROM_DEFAULT_CUSTOMERID			0xAB
#define EEPROM_DEFAULT_SUBCUSTOMERID		0xCD
#define EEPROM_DEFAULT_VERSION				0

#define	EEPROM_CHANNEL_PLAN_FCC				0x0
#define	EEPROM_CHANNEL_PLAN_IC				0x1
#define	EEPROM_CHANNEL_PLAN_ETSI			0x2
#define	EEPROM_CHANNEL_PLAN_SPAIN			0x3
#define	EEPROM_CHANNEL_PLAN_FRANCE			0x4
#define	EEPROM_CHANNEL_PLAN_MKK				0x5
#define	EEPROM_CHANNEL_PLAN_MKK1			0x6
#define	EEPROM_CHANNEL_PLAN_ISRAEL			0x7
#define	EEPROM_CHANNEL_PLAN_TELEC			0x8
#define	EEPROM_CHANNEL_PLAN_GLOBAL_DOMAIN	0x9
#define	EEPROM_CHANNEL_PLAN_WORLD_WIDE_13	0xA
#define	EEPROM_CHANNEL_PLAN_NCC				0xB
#define	EEPROM_CHANNEL_PLAN_BY_HW_MASK		0x80

#define EEPROM_CID_DEFAULT					0x0
#define EEPROM_CID_TOSHIBA					0x4
#define	EEPROM_CID_CCX						0x10
#define	EEPROM_CID_QMI						0x0D
#define EEPROM_CID_WHQL 					0xFE

#define	RTL8192_EEPROM_ID					0x8129

#define RTL8190_EEPROM_ID					0x8129
#define EEPROM_HPON							0x02
#define EEPROM_CLK							0x06
#define EEPROM_TESTR						0x08

#define EEPROM_VID							0x49
#define EEPROM_DID							0x4B
#define EEPROM_SVID							0x4D
#define EEPROM_SMID							0x4F

#define EEPROM_MAC_ADDR						0x67

#define EEPROM_CCK_TX_PWR_INX				0x5A
#define EEPROM_HT40_1S_TX_PWR_INX			0x60
#define EEPROM_HT40_2S_TX_PWR_INX_DIFF		0x66
#define EEPROM_HT20_TX_PWR_INX_DIFF			0x69
#define EEPROM_OFDM_TX_PWR_INX_DIFF			0x6C
#define EEPROM_HT40_MAX_PWR_OFFSET			0x25
#define EEPROM_HT20_MAX_PWR_OFFSET			0x22

#define EEPROM_THERMAL_METER				0x2a
#define EEPROM_XTAL_K						0x78
#define EEPROM_RF_OPT1						0x79
#define EEPROM_RF_OPT2						0x7A
#define EEPROM_RF_OPT3						0x7B
#define EEPROM_RF_OPT4						0x7C
#define EEPROM_CHANNEL_PLAN					0x28
#define EEPROM_VERSION						0x30
#define EEPROM_CUSTOMER_ID					0x31

#define EEPROM_PWRDIFF				0x54

#define EEPROM_TXPOWERCCK			0x10
#define	EEPROM_TXPOWERHT40_1S		0x16
#define	EEPROM_TXPOWERHT40_2SDIFF	0x66
#define EEPROM_TXPOWERHT20DIFF		0x1C
#define EEPROM_TXPOWER_OFDMDIFF		0x1F

#define	EEPROM_TXPWR_GROUP			0x22

#define EEPROM_TSSI_A				0x29
#define EEPROM_TSSI_B				0x77

#define EEPROM_CHANNELPLAN			0x28

#define RF_OPTION1					0x2B
#define RF_OPTION2					0x2C
#define RF_OPTION3					0x2D
#define RF_OPTION4					0x2E

#define	STOPBECON					BIT(6)
#define	STOPHIGHT					BIT(5)
#define	STOPMGT						BIT(4)
#define	STOPVO						BIT(3)
#define	STOPVI						BIT(2)
#define	STOPBE						BIT(1)
#define	STOPBK						BIT(0)

#define	RCR_APPFCS					BIT(31)
#define	RCR_APP_MIC					BIT(30)
#define	RCR_APP_ICV					BIT(29)
#define	RCR_APP_PHYST_RXFF			BIT(28)
#define	RCR_APP_BA_SSN				BIT(27)
#define	RCR_ENMBID					BIT(24)
#define	RCR_LSIGEN					BIT(23)
#define	RCR_MFBEN					BIT(22)
#define	RCR_HTC_LOC_CTRL			BIT(14)
#define	RCR_AMF						BIT(13)
#define	RCR_ACF						BIT(12)
#define	RCR_ADF						BIT(11)
#define	RCR_AICV					BIT(9)
#define	RCR_ACRC32					BIT(8)
#define	RCR_CBSSID_BCN				BIT(7)
#define	RCR_CBSSID_DATA				BIT(6)
#define	RCR_CBSSID					RCR_CBSSID_DATA
#define	RCR_APWRMGT					BIT(5)
#define	RCR_ADD3					BIT(4)
#define	RCR_AB						BIT(3)
#define	RCR_AM						BIT(2)
#define	RCR_APM						BIT(1)
#define	RCR_AAP						BIT(0)
#define	RCR_MXDMA_OFFSET			8
#define	RCR_FIFO_OFFSET				13

#define RSV_CTRL					0x001C
#define RD_CTRL						0x0524

#define REG_USB_INFO				0xFE17
#define REG_USB_SPECIAL_OPTION		0xFE55
#define REG_USB_DMA_AGG_TO			0xFE5B
#define REG_USB_AGG_TO				0xFE5C
#define REG_USB_AGG_TH				0xFE5D

#define REG_USB_VID					0xFE60
#define REG_USB_PID					0xFE62
#define REG_USB_OPTIONAL			0xFE64
#define REG_USB_CHIRP_K				0xFE65
#define REG_USB_PHY					0xFE66
#define REG_USB_MAC_ADDR			0xFE70
#define REG_USB_HRPWM				0xFE58
#define REG_USB_HCPWM				0xFE57

#define SW18_FPWM					BIT(3)

#define ISO_MD2PP					BIT(0)
#define ISO_UA2USB					BIT(1)
#define ISO_UD2CORE					BIT(2)
#define ISO_PA2PCIE					BIT(3)
#define ISO_PD2CORE					BIT(4)
#define ISO_IP2MAC					BIT(5)
#define ISO_DIOP					BIT(6)
#define ISO_DIOE					BIT(7)
#define ISO_EB2CORE					BIT(8)
#define ISO_DIOR					BIT(9)

#define PWC_EV25V					BIT(14)
#define PWC_EV12V					BIT(15)

#define FEN_BBRSTB					BIT(0)
#define FEN_BB_GLB_RSTn				BIT(1)
#define FEN_USBA					BIT(2)
#define FEN_UPLL					BIT(3)
#define FEN_USBD					BIT(4)
#define FEN_DIO_PCIE				BIT(5)
#define FEN_PCIEA					BIT(6)
#define FEN_PPLL					BIT(7)
#define FEN_PCIED					BIT(8)
#define FEN_DIOE					BIT(9)
#define FEN_CPUEN					BIT(10)
#define FEN_DCORE					BIT(11)
#define FEN_ELDR					BIT(12)
#define FEN_DIO_RF					BIT(13)
#define FEN_HWPDN					BIT(14)
#define FEN_MREGEN					BIT(15)

#define PFM_LDALL					BIT(0)
#define PFM_ALDN					BIT(1)
#define PFM_LDKP					BIT(2)
#define PFM_WOWL					BIT(3)
#define EnPDN						BIT(4)
#define PDN_PL						BIT(5)
#define APFM_ONMAC					BIT(8)
#define APFM_OFF					BIT(9)
#define APFM_RSM					BIT(10)
#define AFSM_HSUS					BIT(11)
#define AFSM_PCIE					BIT(12)
#define APDM_MAC					BIT(13)
#define APDM_HOST					BIT(14)
#define APDM_HPDN					BIT(15)
#define RDY_MACON					BIT(16)
#define SUS_HOST					BIT(17)
#define ROP_ALD						BIT(20)
#define ROP_PWR						BIT(21)
#define ROP_SPS						BIT(22)
#define SOP_MRST					BIT(25)
#define SOP_FUSE					BIT(26)
#define SOP_ABG						BIT(27)
#define SOP_AMB						BIT(28)
#define SOP_RCK						BIT(29)
#define SOP_A8M						BIT(30)
#define XOP_BTCK					BIT(31)

#define ANAD16V_EN					BIT(0)
#define ANA8M						BIT(1)
#define MACSLP						BIT(4)
#define LOADER_CLK_EN				BIT(5)
#define _80M_SSC_DIS				BIT(7)
#define _80M_SSC_EN_HO				BIT(8)
#define PHY_SSC_RSTB				BIT(9)
#define SEC_CLK_EN					BIT(10)
#define MAC_CLK_EN					BIT(11)
#define SYS_CLK_EN					BIT(12)
#define RING_CLK_EN					BIT(13)

