FreedomBen/rtl8188ce-linux-driver/rtl8723e/reg.h
#define	BNUM_OFSTF                	0x3
#define	BSHIFT_L                 	0xc0
#define	BGI_TH                   	0xc
#define	BRXPATH_A                 	0x1
#define	BRXPATH_B                 	0x2
#define	BRXPATH_C                 	0x4
#define	BRXPATH_D                 	0x8
#define	BTXPATH_A                 	0x1
#define	BTXPATH_B                 	0x2
#define	BTXPATH_C                 	0x4
#define	BTXPATH_D                 	0x8
#define	BTRSSI_FREQ               	0x200
#define	BADC_BACKOFF              	0x3000
#define	BDFIR_BACKOFF             	0xc000
#define	BTRSSI_LATCH_PHASE         	0x10000
#define	BRX_LDC_OFFSET             	0xff
#define	BRX_QDC_OFFSET             	0xff00
#define	BRX_DFIR_MODE              	0x1800000
#define	BRX_DCNF_TYPE              	0xe000000
#define	BRXIQIMB_A               	0x3ff
#define	BRXIQIMB_B               	0xfc00
#define	BRXIQIMB_C               	0x3f0000
#define	BRXIQIMB_D               	0xffc00000
#define	BDC_DC_NOTCH             	0x60000
#define	BRXNB_NOTCH              	0x1f000000
#define	BPD_TH                   	0xf
#define	BPD_TH_OPT2              	0xc000
#define	BPWED_TH                 	0x700
#define	BIFMF_WIN_L              	0x800
#define	BPD_OPTION               	0x1000
#define	BMF_WIN_L                	0xe000
#define	BBW_SEARCH_L             	0x30000
#define	BWIN_ENH_L               	0xc0000
#define	BBW_TH                   	0x700000
#define	BED_TH2                  	0x3800000
#define	BBW_OPTION               	0x4000000
#define	BRADIO_TH                	0x18000000
#define	BWINDOW_L                	0xe0000000
#define	BSBD_OPTION              	0x1
#define	BFRAME_TH                	0x1c
#define	BFS_OPTION               	0x60
#define	BDC_SLOPE_CHECK          	0x80
#define	BFGUARD_COUNTER_DC_L     	0xe00
#define	BFRAME_WEIGHT_SHORT      	0x7000
#define	BSUB_TUNE                	0xe00000
#define	BFRAME_DC_LENGTH         	0xe000000
#define	BSBD_START_OFFSET        	0x30000000
#define	BFRAME_TH_2              	0x7
#define	BFRAME_GI2_TH            	0x38
#define	BGI2_SYNC_EN             	0x40
#define	BSARCH_SHORT_EARLY       	0x300
#define	BSARCH_SHORT_LATE        	0xc00
#define	BSARCH_GI2_LATE          	0x70000
#define	BCFOANTSUM               	0x1
#define	BCFOACC                  	0x2
#define	BCFOSTARTOFFSET          	0xc
#define	BCFOLOOPBACK             	0x70
#define	BCFOSUMWEIGHT            	0x80
#define	BDAGCENABLE              	0x10000
#define	BTXIQIMB_A               	0x3ff
#define	BTXIQIMB_b               	0xfc00
#define	BTXIQIMB_C               	0x3f0000
#define	BTXIQIMB_D               	0xffc00000
#define	BTXIDCOFFSET             	0xff
#define	BTXIQDCOFFSET             	0xff00
#define	BTXDFIRMODE              	0x10000
#define	BTXPESUDO_NOISEON         	0x4000000
#define	BTXPESUDO_NOISE_A         	0xff
#define	BTXPESUDO_NOISE_B         	0xff00
#define	BTXPESUDO_NOISE_C         	0xff0000
#define	BTXPESUDO_NOISE_D         	0xff000000
#define	BCCA_DROPOPTION           	0x20000
#define	BCCA_DROPTHRES            	0xfff00000
#define	BEDCCA_H                 	0xf
#define	BEDCCA_L                 	0xf0
#define	BLAMBDA_ED               	0x300
#define	BRX_INITIALGAIN           	0x7f
#define	BRX_ANTDIV_EN              	0x80
#define	BRX_AGC_ADDRESS_FOR_LNA     0x7f00
#define	BRX_HIGHPOWER_FLOW         	0x8000
#define	BRX_AGC_FREEZE_THRES        0xc0000
#define	BRX_FREEZESTEP_AGC1       	0x300000
#define	BRX_FREEZESTEP_AGC2       	0xc00000
#define	BRX_FREEZESTEP_AGC3       	0x3000000
#define	BRX_FREEZESTEP_AGC0       	0xc000000
#define	BRXRSSI_CMP_EN           	0x10000000
#define	BRXQUICK_AGCEN            	0x20000000
#define	BRXAGC_FREEZE_THRES_MODE    0x40000000
#define	BRX_OVERFLOW_CHECKTYPE     	0x80000000
#define	BRX_AGCSHIFT              	0x7f
#define	BTRSW_TRI_ONLY           	0x80
#define	BPOWER_THRES              	0x300
#define	BRXAGC_EN                 	0x1
#define	BRXAGC_TOGETHER_EN         	0x2
#define	BRXAGC_MIN                	0x4
#define	BRXHP_INI                	0x7
#define	BRXHP_TRLNA              	0x70
#define	BRXHP_RSSI               	0x700
#define	BRXHP_BBP1               	0x7000
#define	BRXHP_BBP2               	0x70000
#define	BRXHP_BBP3               	0x700000
#define	BRSSI_H                  	0x7f0000
#define	BRSSI_GEN                	0x7f000000
#define	BRXSETTLE_TRSW           	0x7
#define	BRXSETTLE_LNA            	0x38
#define	BRXSETTLE_RSSI           	0x1c0
#define	BRXSETTLE_BBP            	0xe00
#define	BRXSETTLE_RXHP           	0x7000
#define	BRXSETTLE_ANTSW_RSSI     	0x38000
#define	BRXSETTLE_ANTSW          	0xc0000
#define	BRXPROCESS_TIME_DAGC      	0x300000
#define	BRXSETTLE_HSSI           	0x400000
#define	BRXPROCESS_TIME_BBPPW     	0x800000
#define	BRXANTENNA_POWER_SHIFT     	0x3000000
#define	BRSSI_TABLE_SELECT         	0xc000000
#define	BRXHP_FINAL              	0x7000000
#define	BRXHPSETTLE_BBP          	0x7
#define	BRXHTSETTLE_HSSI         	0x8
#define	BRXHTSETTLE_RXHP         	0x70
#define	BRXHTSETTLE_BBPPW        	0x80
#define	BRXHTSETTLE_IDLE         	0x300
#define	BRXHTSETTLE_RESERVED     	0x1c00
#define	BRXHT_RXHP_EN              	0x8000
#define	BRXAGC_FREEZE_THRES      	0x30000
#define	BRXAGC_TOGETHEREN       	0x40000
#define	BRXHTAGC_MIN              	0x80000
#define	BRXHTAGC_EN               	0x100000
#define	BRXHTDAGC_EN              	0x200000
#define	BRXHT_RXHP_BBP            	0x1c00000
#define	BRXHT_RXHP_FINAL          	0xe0000000
#define	BRXPW_RADIO_TH             	0x3
#define	BRXPW_RADIO_EN             	0x4
#define	BRXMF_HOLD                	0x3800
#define	BRXPD_DELAY_TH1          	0x38
#define	BRXPD_DELAY_TH2          	0x1c0
#define	BRXPD_DC_COUNT_MAX       	0x600
#define	BRXPD_DELAY_TH           	0x8000
#define	BRXPROCESS_DELAY         	0xf0000
#define	BRXSEARCHRANGE_GI2_EARLY 	0x700000
#define	BRXFRAME_FUARD_COUNTER_L 	0x3800000
#define	BRXSGI_GUARD_L           	0xc000000
#define	BRXSGI_SEARCH_L          	0x30000000
#define	BRXSGI_TH                	0xc0000000
#define	BDFSCNT0                 	0xff
#define	BDFSCNT1                 	0xff00
#define	BDFSFLAG                 	0xf0000
#define	BMF_WEIGHT_SUM             	0x300000
#define	BMINIDX_TH                	0x7f000000
#define	BDAFORMAT                	0x40000
#define	BTXCH_EMU_ENABLE           	0x01000000
#define	BTRSW_ISOLATION_A         	0x7f
#define	BTRSW_ISOLATION_B         	0x7f00
#define	BTRSW_ISOLATION_C         	0x7f0000
#define	BTRSW_ISOLATION_D         	0x7f000000
#define	BEXT_LNA_GAIN              	0x7c00

#define	BSTBC_EN                  	0x4
#define	BANTENNA_MAPPING          	0x10
#define	BNSS                     	0x20
#define	BCFO_ANTSUM_ID              0x200
#define	BPHY_COUNTER_RESET         	0x8000000
#define	BCFO_REPORT_GET            	0x4000000
#define	BOFDM_CONTINUE_TX          	0x10000000
#define	BOFDM_SINGLE_CARRIER       	0x20000000
#define	BOFDM_SINGLE_TONE          	0x40000000
#define	BHT_DETECT                	0x100
#define	BCFOEN                   	0x10000
#define	BCFOVALUE                	0xfff00000
#define	BSIGTONE_RE              	0x3f
#define	BSIGTONE_IM              	0x7f00
#define	BCOUNTER_CCA             	0xffff
#define	BCOUNTER_PARITYFAIL      	0xffff0000
#define	BCOUNTER_RATEILLEGAL     	0xffff
#define	BCOUNTER_CRC8FAIL        	0xffff0000
#define	BCOUNTER_MCSNOSUPPORT    	0xffff
#define	BCOUNTER_FASTSYNC        	0xffff
#define	BSHORTCFO                	0xfff
#define	BSHORTCFOT_LENGTH         	12
#define	BSHORTCFOF_LENGTH         	11
#define	BLONGCFO                 	0x7ff
#define	BLONGCFOT_LENGTH          	11
#define	BLONGCFOF_LENGTH          	11
#define	BTAILCFO                 	0x1fff
#define	BTAILCFOT_LENGTH          	13
#define	BTAILCFOF_LENGTH          	12
#define	BNOISE_EN_PWDB             	0xffff
#define	BCC_POWER_DB             	0xffff0000
#define	BMOISE_PWDB              	0xffff
#define	BPOWERMEAST_LENGTH        	10
#define	BPOWERMEASF_LENGTH        	3
#define	BRX_HT_BW                	0x1
#define	BRXSC                    	0x6
#define	BRX_HT                   	0x8
#define	BNB_INTF_DET_ON          	0x1
#define	BINTF_WIN_LEN_CFG        	0x30
#define	BNB_INTF_TH_CFG          	0x1c0
#define	BRFGAIN                  	0x3f
#define	BTABLESEL                	0x40
#define	BTRSW                    	0x80
#define	BRXSNR_A                 	0xff
#define	BRXSNR_B                 	0xff00
#define	BRXSNR_C                 	0xff0000
#define	BRXSNR_D                 	0xff000000
#define	BSNR_EVMT_LENGTH           	8
#define	BSNR_EVMF_LENGTH           	1
#define	BCSI1ST                  	0xff
#define	BCSI2ND                  	0xff00
#define	BRXEVM1ST                	0xff0000
#define	BRXEVM2ND                	0xff000000
#define	BSIGEVM                  	0xff
#define	BPWDB                    	0xff00
#define	BSGIEN                   	0x10000

#define	BSFACTOR_QMA1             	0xf
#define	BSFACTOR_QMA2             	0xf0
#define	BSFACTOR_QMA3             	0xf00
#define	BSFACTOR_QMA4             	0xf000
#define	BSFACTOR_QMA5             	0xf0000
#define	BSFACTOR_QMA6             	0xf0000
#define	BSFACTOR_QMA7             	0xf00000
#define	BSFACTOR_QMA8             	0xf000000
#define	BSFACTOR_QMA9             	0xf0000000
#define	BCSI_SCHEME               	0x100000

